//#include "delay.h"

#include "chokeDelay.h"

/***************************************************************************
;** 函数名称: 	
;** 功能描述:  	us delay
;** 输入参数: 
;** 返 回 值: 
;** 全局变量: 
;** 调用模块: 
;** 作　  者:   M-L-A
;** 日　  期:  2012-6-29
;** 修改原因：
;** 说    明:	 不是很准确	   <=255us
;***************************************************************************/
void delay_us(unsigned int us)
{
	unsigned char d;

	while(us--)
	{
		d=18;
		while(d--);
	}
}
/***************************************************************************
;** 函数名称: 	
;** 功能描述:  	us delay
;** 输入参数: 
;** 返 回 值: 
;** 全局变量: 
;** 调用模块: 
;** 作　  者:   M-L-A
;** 日　  期:  2012-6-29
;** 修改原因：
;** 说    明:	 
;***************************************************************************/
void delay_ms( uint16_t ms)
{
	uint16_t d;

	while(ms--)
	{
		d=20600; 
		while(d--);
	}
}


